import pandas as pd
df = pd.read_csv('GooglePlayStore_wild.csv')

df.info()
# Виведи інформацію про всі DataFrame, щоб дізнатися, які стовпці потребують очищення
# Скільки в датасеті додатків, у яких не вказано (NaN) рейтинг (Rating)?
print(10840-9366)
# Заміни порожнє значення ('NaN') рейтингу ('Rating') для таких програм на -1.
df['Rating'].fillna(-1, inplace=True)
df.info()
# Визнач, яке ще значення розміру ('Size') зберігається в датасеті крім Кілобайтів та Мегабайтів, заміни його на -1.
# Перетвори розміри додатків ('Size') у числовий формат (float). Розмір усіх програм повинен вимірюватися в Мегабайтах.

print(df['Size'].value_counts())

# 1К = 1024 байти
# 1Мб = 1024 Кб

def clean_size(size):
    if 'M' in size:
        size =  size.replace("M", "")
        return float(size)
    elif 'k' in size:
        size =  size.replace("k", "")
        return float(size) / 1024
    else:
        return -1
    

df['Size'] = df['Size'].apply(clean_size)    
df.info()

df.to_csv('cleaned.csv', index=False)

# Чому дорівнює максимальний розмір ('Size') додатків з категорії ('Category') 'TOOLS'?
print(df[df['Category']== 'TOOLS']['Size'].max())
# Бонусні завдання
# Заміни тип даних на цілий (int) для кількості установок ('Installs').
# У записі кількості установок ('Installs') знак "+" необхідно ігнорувати.
# Тобто, якщо в датасеті кількість установок дорівнює 1,000,000+, необхідно змінити значення на 1000000

# Згрупуй дані за категорією ('Category') та цільовою аудиторією ('Content Rating') будь-яким зручним для тебе способом,
# Порахуй середню кількість установок ('Installs') у кожній групі. Результат округлили до десятих.
# В отриманій таблиці знайди клітинку з найбільшим значенням.
# До якої вікової групи та типу додатків відносяться дані з цієї клітинки?

# У якої програми не вказаний тип ('Type')? Який тип там потрібно записати залежно від ціни?

# Виведи інформацію про все DataFrame, щоб переконатися, що очищення пройшло успішно